In [1]:
import numpy as np
import pandas as pd

In [3]:
dataset = {
    "Departman":["Bilişim","İnsan Kaynakları","Üretim","Üretim","Bilişim","İnsan Kaynakları"],
    "Çalışan":["Mustafa","Jale","Kadir","Zeynep","Murat","Ahmet"],
    "Maaş":[3000,3500,2500,4500,4000,2000]
}

In [4]:
df = pd.DataFrame(dataset)

In [5]:
df

          Departman  Çalışan  Maaş
0           Bilişim  Mustafa  3000
1  İnsan Kaynakları     Jale  3500
2            Üretim    Kadir  2500
3            Üretim   Zeynep  4500
4           Bilişim    Murat  4000
5  İnsan Kaynakları    Ahmet  2000

In [6]:
DepGroup = df.groupby("Departman")

In [8]:
DepGroup

In [9]:
DepGroup.sum()

                  Maaş
Departman
Bilişim           7000
Üretim            7000
İnsan Kaynakları  5500

In [10]:
df.groupby("Departman").sum()

                  Maaş
Departman
Bilişim           7000
Üretim            7000
İnsan Kaynakları  5500

In [11]:
df.groupby("Departman").sum().loc["Bilişim"]

Maaş    7000
Name: Bilişim, dtype: int64

In [12]:
int(df.groupby("Departman").sum().loc["Bilişim"])

7000

In [13]:
df.groupby("Departman").count()

                  Çalışan  Maaş
Departman
Bilişim                 2     2
Üretim                  2     2
İnsan Kaynakları        2     2

In [14]:
df.groupby("Departman").max()

                  Çalışan  Maaş
Departman
Bilişim           Mustafa  4000
Üretim             Zeynep  4500
İnsan Kaynakları     Jale  3500

In [15]:
df.groupby("Departman").min()

                 Çalışan  Maaş
Departman
Bilişim            Murat  3000
Üretim             Kadir  2500
İnsan Kaynakları   Ahmet  2000

In [16]:
df.groupby("Departman").min()["Maaş"]

Departman
Bilişim             3000
Üretim              2500
İnsan Kaynakları    2000
Name: Maaş, dtype: int64

In [17]:
df.groupby("Departman").min()["Maaş"]["Bilişim"]

3000

In [18]:
df.groupby("Departman").mean()

                    Maaş
Departman
Bilişim           3500.0
Üretim            3500.0
İnsan Kaynakları  2750.0

In [19]:
df.groupby("Departman").mean()["Maaş"]["İnsan Kaynakları"]

2750.0